export const REGIONAL_KEYBOARD = ["京", "沪", "浙", "苏", "粤", "鲁", "晋", "冀",
	"豫", "川", "渝", "辽", "吉", "黑", "皖", "鄂",
	"津", "贵", "云", "桂", "琼", "青", "新", "藏",
	"蒙", "宁", "甘", "陕", "闽", "赣", "湘"
];
export const NUMBER_KEYBOARD = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"];

export const NUMBER = ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0"];

export const LETTER_KEYBOARD = ["Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P",

	"A", "S", "D", "F", "G", "H", "J", "K", "L", "澳",
	"Z", "X", "C", "V", "B", "N", "M", "港"
];

export const INVOICE_TYPE = {
	1: '已申请',
	2: '已开票',
	3: '开票失败'
}
export const HEAD_TYPE = {
	1: '个人',
	2: '公司',
}

export const STAGGER_TYPE = {
	1: '错峰停车',
	2: '包月停车',
}

export const COLOR = {
	1: '#1AD19D', //绿
	2: '#FED215', //黄
	3: '#FF6767', //红
	4: '#D5D5D6', //灰
}
export const PUBLIC = {
	1000: '失败',

	1001: '异常',

	2000: '参数校验失败',

	2001: '必选参数不能为空',

	2002: '参数格式错误',

	2003: '验证码错误',

	2004: '超出有效期',

	3001: '获取信息失败',

	3101: '获取信息失败',

	3102: '获取返回码失败',

	4000: '身份认证失败',

	4001: '认证失败',

	4002: '获取用户信息失败',

	1: '数据校验失败',

	2: '非法访问',

	3: '其他错误'
}

export const RESULTCode = {
	9000: "订单支付成功",
	8000: "支付结果超时",
	6004: "网络错误",
	7001: "中止支付",
	6002: "网络错误",
	6001: "用户中途取消",
	4000: "订单支付失败",
	99: "用户退出"
}

export const WEEK = {
    '0': '周日',
	'1': '周一',
	'2': '周二',
	'3': '周三',
	'4': '周四',
	'5': '周五',
	'6': '周六',
	
}

export const WEEKNUM = ["1", "2", "3", "4", "5", "6", "7"]

export const RULLIST = [
	'购买后一个工作日会有客服主动与您联系，核对信息以及相关事宜；',
	'如出现车位已满等异常情况，优会停将主动联系您，并将错峰预约费用在一周内原路退回；',
	'错峰包月套餐经客服确认后不支持取消包月预约服务，如需发票可致电客服；',
	"停车期间，请遵守《上海市公共停车场（库）停车规则》及停车场管理制度，按照停车场管理人员要求停放车辆，如车辆在停车场内出现意外损伤等情况，请直接与场库方沟通，责任与我方预约平台无关；",
	"车辆停放期间，请车主严格遵守错峰时间，如有超时，请按照停车场临停计费(以停车场收费标准为准），如车主超时三次拒付超时费的，车主将会进入优会停黑名单，无法购买错峰包月服务。"
]


export const MON = [
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    []
]
